%==========================================================================
%Восстановление тока путем обратной задачи. При запуске функции "CurrentProcess"
%необходимо в аргумент функции задать исходный массив "current", который
%содержит массив времени и тока.
%==========================================================================
function i_reconstrac = CurrentProcess (current, StartWindow, EndWindow)
    
    t = current.Time(StartWindow:EndWindow); %здание массива времени
    i_ideal = current.Ideal(StartWindow:EndWindow); %здание массива этал. тока
    i_meas = current.Meas(StartWindow:EndWindow);  %здание массива изм. тока

    %----------------------------------------------------------------------
    %Вызов функции "CTParam", которая объявляет параметры ТТ в виде
    %структуры.
    %----------------------------------------------------------------------
    CTParam = ctParam ();
    
%     if CTParam.dt < abs(t(2) - t(1))
%         disp('шаг дискретизации исходного массива меньше 80 точек/период');
%         return
%     elseif CTParam.dt > abs(t(2) - t(1))
%         disp('шаг дискретизации исходного массива больше 80 точек/период');
%         return
%     end
%     
%     if length (t) > 401
%         disp('длина массива в "current" больше чем три преиода');
%             return
%     elseif length (t) < 241
%         disp('длина массива в "current" меньше чем три преиода');
%             return
%     end
    SATURATION1 = zeros(length(i_meas),1);%Детектор нужен для демонстрации 
    Amplitude1 = 0;%Прогнозируемая амплитуда тока
    SAT = 0; %Счетчик искаженных полупериодов измеренного тока
    K = 16; %Необходимая длина окна для корректного расчета дисперсий индукции
    
    Th2 = 0.0028; %Порог насыщения.  
    n = 1:length(t); %Порядковый номер массива времени
    
%     i_reconstrac = i_meas; 
        
    nt = CTParam.w2 / CTParam.w1; %Коэффициент трансфорамции
    
    %----------------------------------------------------------------------
    %вызов функции расчета магнитной индукции бе учета начальной индукции
    %----------------------------------------------------------------------
    Flux = flux (i_meas, CTParam);
    
    %----------------------------------------------------------------------
    %В целях приближения к реальным условиям зашумляем измерения. Для этого
    %вызывается функция NoisyCurrent.
    %----------------------------------------------------------------------
%     NoisyCurrent = nois (i_meas);
      NoisyCurrent = i_meas;
    
    i_reconstrac = NoisyCurrent;
     p = 4; %Локальный счетчик
     i = 0;
    for h2  = p:length (i_meas)
        
        %------------------------------------------------------------------
        %Вызов функции проверки режима сети
        %------------------------------------------------------------------
        [Amplitude1, Amplitude2] = Apm(p, Amplitude1, i_meas, CTParam);
        
        Th1 = CTParam.I_rated * sqrt(2) * 2 / nt; %Уставка маскимального режима 
        
        if Amplitude2 > Th1 && Amplitude1 > Th1 %Проверка тока КЗ
        
            p = p + K; %Время задержки детектора
        
            %--------------------------------------------------------------
            %Блок проверки наличия насыщения ТТ, прогнозирования начла 
            %участка насыщения и восстановления тока
            %--------------------------------------------------------------
            for h3 = p:length(i_meas) 

                DENSITY_VAR = var (Flux(p-K:p)); %Дисперсия индукции 

                i_filter(p-K,1) = mean(NoisyCurrent(p-K-1:p-K));%Сглаживание тока 

                if DENSITY_VAR <= Th2 %условие возникновения насыщения
                    
                   SATURATION1 (p-K) = 1.2;
                   
                   StrtSaturation = (p-K);
                   
                   tic
                   %-------------------------------------------------------
                   %вызов функции прогнозирования начала искаженного участка
                   %-------------------------------------------------------
                   Prognoz = prognoz (t, p, K, i_filter, CTParam);
%                    tic
                   %-------------------------------------------------------
                   %вызов функции поиска начальной индукции
                   %-------------------------------------------------------
                   [Initial, h5, i_reconstrac] = initial (p, K, i_meas,...
                       Prognoz, n, i_ideal, CTParam, i_reconstrac); 
                   i = 1 + i;
                   ElapsedTime (i) = toc;
                   %-------------------------------------------------------
                   %вызов функции восстановления тока
                   %-------------------------------------------------------
                   [p, i_reconstrac] = compensate (Initial,...
                       i_meas, h5, p, t, i_ideal, CTParam, i_reconstrac);
   
                end %if DENSITY_VAR

                p = p + 1; %обновление номера счетчика

                if p >= length(i_meas) %определение конца массива данных
                    break
                end
            end %for h5
        end %if amplitude
    
        p = p + 1;% обновление номера счетчика
        
        if p >= length(i_meas)%определение конца массива тока
            break
        end
    end%h2            
    %----------------------------------------------------------------------
    %Вызов функции расчета относительных погрешностей параметров модели
    %тока
    %----------------------------------------------------------------------
%     ElapsedTime = mean(ElapsedTime,2);
%     err1 (t, i_reconstrac, ElapsedTime, i_ideal);

%     Plot(n, i_reconstrac, i_ideal); 
end

%==========================================================================
%Функция возвращает параметры ТТ и сети
%==========================================================================
function CTParam = ctParam ()

    %s - поперечное сечение сердечника ТТ, м^2
    %l - средняя длина магнитной пути, м
    %w2 - число витков вторичной обмотки
    %w1 - число витков первичной обмотки
    %I_rated - номинальный ток ТТ, А
    %R2 - активное сопротивление вторичной обмотки, Ом
    %Rn - активное сопротивление нагрузки, Ом
    %L2 - индуктивность вторичной обмотки, Гн
    %Ln - индуктивность нагрузки, Гн 
    %N - плотность измерения, точек/период
    %dt - шаг дискретизации, с
    %t - интервал моделирования, с
    %om - циклическая часота, рад/с
    %b1, b2 - коэффициенты кривой намагничивания, которые получаются в
    %результате апроксимации этой кривой

    CTParam = struct('s', 19.1e-4, 'l', 90e-2, 'w2', 239, 'w1', 2, 'I_rated',...
        600, 'R2', 0.48, 'Rn', 0.96, 'L2', 0, 'Ln', 0, 'N', 80, 'dt',...
        2.5e-4, 'om', 100*pi, 'b2', 13.917, 'b1', 1.761e-08);
%     CTParam = struct('s', 19.1e-4, 'l', 90e-2, 'w2', 239, 'w1', 2, 'I_rated',...
%         600, 'R2', 0.48, 'Rn', 0.96, 'L2', 0, 'Ln', 0, 'N', 80, 'dt',...
%         2.5e-4, 'om', 100*pi, 'b1', 1248, 'b2', -8444, 'b3', 1.608e4,...
%         'b4', -1.347e4, 'b5', 5623, 'b6', -1154, 'b7', 93.78);
end

%==========================================================================
%Функция расчет магнитной индукции без учета начальной. На основе результата 
%этой функции рассчитывается дисперсия и детектируется насыщение.
%==========================================================================
function Flux = flux (i_meas, CTParam)
            
      Flux = zeros (length(i_meas),1);
       
      for h1 = 2:length(i_meas)
          Flux(h1) = Flux(h1-1) + ((CTParam.R2 + CTParam.Rn) * (i_meas(h1)...
              + i_meas(h1-1)) * CTParam.dt / 2 / (CTParam.s * CTParam.w2)...
              + (i_meas(h1) - i_meas(1)) * (CTParam.L2 + CTParam.Ln) /...
              (CTParam.s * CTParam.w2));
      end
%       plot(Flux);
end

%==========================================================================
%Функция зашумляет сигнал.
%==========================================================================
function NoisyCurrent = nois (i_meas)
    for h = 1:length(i_meas)
        NoisyCurrent (h,1) = i_meas(h) * (1 + 0.1 * (2 * rand(1,1)-1)) + ...
            (2 * rand(1,1)-1) * 0.1 * max(i_meas);
    end
end

%==========================================================================
%Функция проверка наличия КЗ в сети путем прогнозирования амплитуды
%измеренного тока.
%==========================================================================
function [Amplitude1, Amplitude2] = Apm(p, Amplitude1, i_meas, CTParam)
        %------------------------------------------------------------------
        % Проверка Режима Сети
        %------------------------------------------------------------------
        i0 = i_meas(p);%измеренный ток 
        
        v0 = (i_meas(p - 1) - i_meas(p + 1)) / 2 / CTParam.dt;%Производная от тока
        
        Amplitude = sqrt(i0^2 + (v0 / CTParam.om)^2);%Амплитуда тока
        
        Amplitude2 = Amplitude1;
        
        Amplitude1 = Amplitude;
end

%==========================================================================
%Функция прогнозирования начала учаска насыщения. На основе результата 
%этой функции производится посик начальной индукции.
%==========================================================================
function Prognoz = prognoz (t, p, K, i_filter, CTParam)
%       A = [t(p-K-12:p-K-2).^2 t(p-K-12:p-K-2) ones(length(p-K-12:p-K-2),1)];
%       
%       b = i_filter(p-K-12:p-K-2);
%       
%       z = A\b;
%       
%       Prognoz = z(1,1) * t(p-K+1:p-K+3).^2 + z(2,1) * t(p-K+1:p-K+3) + z(3,1);
      
      A = [sin(100*pi * t(p-K-6:p-K-2)) cos(100*pi * t(p-K-6:p-K-2))];
                        
      b = i_filter(p-K-6:p-K-2);
      
      z = A\b;
      
      Prognoz = z(1,1) * sin(CTParam.om * t(p-K+1:p-K+3)) + z(2,1) * cos(CTParam.om * t(p-K+1:p-K+3));
end

%==========================================================================
%В этой части алгоритма решается задача поиска начальной индукции с помощью
%минимизации целевой функции.
%==========================================================================
function [Initial, h5, i_reconstrac] = initial (p, K, i_meas,...
                       Prognoz, n, i_ideal, CTParam, i_reconstrac)
        
        for h4 = 1:40
        
            %Задание начальной индукции
            Initial = 1.6 + (h4-1)*0.01; 
            
            %Определение знака начальной индукции
            if i_meas(p-K) < 0
               Initial = -1*Initial;
            end
            
            %Проверка точности намагничивающего Тока im0
            for h5 = p-K+1:p-K+3
                
                B (h5) = Initial + ((CTParam.R2 + CTParam.Rn) * ...
                    (i_meas(h5) + i_meas(h5-1)) * CTParam.dt / 2 /...
                    (CTParam.s * CTParam.w2) + (i_meas(h5) - i_meas(h5-1))*...
                    (CTParam.L2 + CTParam.Ln) / (CTParam.s * CTParam.w2));
                
                Initial = B (h5);
            end
            B1 = B (p-K+1:p-K+3)';
            %намагничивающий ток
            im0 = (CTParam.l * CTParam.b1 * sinh(CTParam.b2 * B1)) / CTParam.w2;
%             im0 = CTParam.l * (CTParam.b1 * B1 + CTParam.b2 * B1.^3 +...
%                 CTParam.b3 * B1.^5 + CTParam.b4 * B1.^7 +...
%                 CTParam.b5 * B1.^9 + CTParam.b6 * B1.^11 + CTParam.b7 * B1.^13) / CTParam.w2;
            
            %восстановленный по кривой намагничивания ток
            i_curve = i_meas(p-K+1:p-K+3) + im0;

%             plot(n, i_meas, 'r-', n, i_ideal, 'k-', n(p-K+1:p-K+3), Prognoz, 'o-', ...
%                 n(p-K+1:p-K+3), i_curve, '-x','linewidth',1.2); grid minor;
            
            %погрешность восстановленного с помощью кривой намаг-я тока
            resudal = abs(Prognoz - i_curve) ./ abs(Prognoz) .* 100;
            
            error = norm(resudal);
            
            if error < 10% && sum(abs(i_curve)) > sum(abs(Prognoz))
                i_reconstrac (p-K+1:p-K+3) = i_curve;
                break
            end
        end%р4
end

%==========================================================================
%Функция восстановления тока на каждом полупериоде.
%==========================================================================
function [p, i_reconstrac] = compensate (Initial,...
                       i_meas, h5, p, t, i_ideal, CTParam, i_reconstrac)
    
    Compensated = zeros (length(i_meas),1);
    for h6 = h5+1:length(i_meas)
            Flux = Initial + ((CTParam.R2 + CTParam.Rn) * ...
                (i_meas(h6) + i_meas(h6-1)) * CTParam.dt/2/...
                 (CTParam.s * CTParam.w2) + (i_meas(h6) - i_meas(h6-1))*...
                 (CTParam.L2 + CTParam.Ln) / (CTParam.s * CTParam.w2));
             
            Initial = Flux;
            
            %Намагничивающий ток
            im0 = (CTParam.l * CTParam.b1 * sinh(CTParam.b2 * Flux)) / CTParam.w2; 
%             im0 = CTParam.l * (CTParam.b1 * Flux + CTParam.b2 * Flux.^3 +...
%                 CTParam.b3 * Flux.^5 + CTParam.b4 * Flux.^7 +...
%                 CTParam.b5 * Flux.^9 +  CTParam.b6 * Flux.^11 + CTParam.b7 * Flux.^13) / CTParam.w2;
            
            Compensated(h6) = i_meas(h6) + im0; %Восстановление тока
            i_reconstrac (h6) = Compensated(h6);%Замена неправильных измерений
%             plot(t, Compensated, t, i_ideal);
            p = p + 1; %Обновление счетчика
            
            % Детекция Перехода Через Ноль По Восст-ному Току
            aa = sign(Compensated(h6-1)) + sign(Compensated(h6)); 
            if aa == 0
               break
           end
    end
end

%==========================================================================
%Функция производить относительную погрешность параметров модели.
%==========================================================================
function err1 (t, i_reconstrac, ElapsedTime, i_ideal)
    
    A = [sin(100*pi * t) cos(100*pi * t) -t ones(length(t),1)];
                        
    B = i_reconstrac;
    
    plot(t, i_reconstrac, '--', t, i_ideal, '-'); grid minor;
      
    Z = A \ B;
    AmpSine = sqrt(Z(1,1)^2 + Z(2,1)^2);
    Phase = asin(Z(2,1) / AmpSine);
    Lyamda = Z(3,1)/Z(4,1);
    AmpExp = Z(4,1);

    AmpErr = abs(120 - AmpSine) / 120 * 100;
    PhaseErr = abs(-pi*45/180 - Phase) / abs(-pi*45/180) * 100;
    AmpExpErr = abs(150 - AmpExp) / 150 * 100;
    LyamdaErr = abs(20 - Lyamda) / 20 * 100;
    Sigma = mean (sqrt((i_ideal - i_reconstrac).^2./120^2))*100;

    R = table(5, AmpErr, PhaseErr, AmpExpErr, LyamdaErr,...
        Sigma, mean(ElapsedTime));
    						
    R.Properties.VariableNames = {'N', 'δА, %', 'δφ, %', 'δВ, %', 'δλ, %', 'σ1, %', 't, с'}
%     writetable(R, 'Эксперименты_3_4.xlsm', 'Sheet', 2, 'Range', 'B1');
end

%==========================================================================
%Функция сниятия графиков и замена искаженных измеренний восстановленными
%==========================================================================
function Plot(n, i_reconstrac, i_ideal)
                   
    plot(n, i_reconstrac, '--', n, i_ideal, '-');
end