%==========================================================================
%Восстановление тока путем обратной задачи. При запуске функции "CurrentProcess"
%необходимо в аргумент функции задать исходный массив "current", который
%содержит массив времени и тока.
%==========================================================================
function [Reconstracted, BuffrNext, options] = TheMethod_Valera(CurrentSat, Buffer, options)
%     clc
    i_meas = [Buffer; CurrentSat]; %здание массива изм. тока
%     n = 1:length(i_ideal);
    
%     plot(n,i_meas, n,i_ideal);  grid minor;
    %----------------------------------------------------------------------
    %Вызов функции "CTParam", которая объявляет параметры ТТ в виде
    %структуры.
    %----------------------------------------------------------------------
    CTParam = ctParam ();
    i_reconstr = i_meas;
    p = 4; %Локальный счетчик
   if options.SAT2 == 1
      %-------------------------------------------------------
      %вызов функции восстановления тока
      %-------------------------------------------------------
      [p, i_reconstr, options] = compensate (i_meas, i_reconstr, 60, 60,...
          CTParam, options);
      Reconstracted = i_reconstr(end-19:end);
      
      BuffrNext = i_reconstr(end-59:end);
      i_meas = i_reconstr;
%       figure
%       plot(n, i_reconstr,n,i_meas, n,i_ideal);  grid minor;
%       return
    end

    Amplitude1 = 0;%Прогнозируемая амплитуда тока     
    nt = CTParam.w2 / CTParam.w1; %Коэффициент трансфорамции
    
    %----------------------------------------------------------------------
    %вызов функции расчета магнитной индукции бе учета начальной индукции
    %----------------------------------------------------------------------
    Flux = flux (i_meas, CTParam);
    
    %----------------------------------------------------------------------
    %Вызов функции расчета производной от тока.
    %----------------------------------------------------------------------
    i3 = derivative_of_meas(i_meas, CTParam);
    
    %----------------------------------------------------------------------
    %Вызов функции сглаживания белого шума от тока.
    %----------------------------------------------------------------------
    i4 = smuth_of_derivativeted_meas(i3, CTParam);
    
    
    for h2  = p:length (i_meas)
                
        %------------------------------------------------------------------
        %Вызов функции проверки режима сети
        %------------------------------------------------------------------
        [Amplitude1, Amplitude2] = Apm(p, Amplitude1, i_meas, CTParam);
        
        Th1 = CTParam.I_rated * sqrt(2) * 2 / nt; %Уставка маскимального режима 
        
        if Amplitude2 > Th1 && Amplitude1 > Th1 %Проверка тока КЗ
        
            options.SAT1 = 1;
            for h3 = p:length(i_meas)
            %--------------------------------------------------------------
            %Вызов функции детекции насыщения.
            %--------------------------------------------------------------
            [DENSITY_VAR, p] = input(i4, Flux, CTParam, p);
%             p = p + L; %Время задержки детектора
        
            %--------------------------------------------------------------
            %Блок проверки наличия насыщения ТТ, прогнозирования начла 
            %участка насыщения и восстановления тока
            %--------------------------------------------------------------
            if DENSITY_VAR == 1 %условие возникновения насыщения

               options.SAT2 = 1;
               %---------------------------------------------------
               %Функциz прогнозирования начала искаженного участка
               %---------------------------------------------------
               Prognoz = prognoz (p, i_meas, CTParam);

               %---------------------------------------------------
               %вызов функции поиска начальной индукции
               %---------------------------------------------------
               [options, h5, i_reconstr] = initial (options, p,...
                           i_meas, Prognoz, CTParam, i_reconstr); 
                   
               %-------------------------------------------------------
               %вызов функции восстановления тока
               %-------------------------------------------------------
               [p, i_reconstr, options] = compensate (i_meas,...
                       i_reconstr, h5, p, CTParam, options);
   
            end %if DENSITY_VAR

               p = p + 1; %обновление номера счетчика
            
               if options.SAT1 == 0 || p >= length(i_meas) %определение конца массива данных
                    Reconstracted = i_reconstr(end-19:end);
                    
                    BuffrNext = i_reconstr(end-59:end);

%                     figure
%                     plot(n, i_reconstr, n,i_meas,'--', n,i_ideal);  grid minor;
                    return
               end
            end %for h3
        end %if amplitude
    
        p = p + 1;% обновление номера счетчика
        
        if p >= length(i_meas)%определение конца массива тока
            Reconstracted = i_meas(end-19:end);
            BuffrNext = i_meas(end-59:end);
%             figure
%             plot(n, i_reconstr, n,i_meas, n,i_ideal);  grid minor;
            return
        end
    end%h2      
end

%==========================================================================
%Функция возвращает параметры ТТ и сети
%==========================================================================
function CTParam = ctParam ()

    %s - поперечное сечение сердечника ТТ, м^2
    %l - средняя длина магнитной пути, м
    %w2 - число витков вторичной обмотки
    %w1 - число витков первичной обмотки
    %I_rated - номинальный ток ТТ, А
    %R2 - активное сопротивление вторичной обмотки, Ом
    %Rn - активное сопротивление нагрузки, Ом
    %L2 - индуктивность вторичной обмотки, Гн
    %Ln - индуктивность нагрузки, Гн 
    %N - плотность измерения, точек/период
    %dt - шаг дискретизации, с
    %t - интервал моделирования, с
    %om - циклическая часота, рад/с
    %b1, b2 - коэффициенты кривой намагничивания, которые получаются в
    %результате апроксимации этой кривой

    CTParam = struct('s', 19.1e-4, 'l', 90e-2, 'w2', 239, 'w1', 2, 'I_rated',...
        600, 'R2', 0.48, 'Rn', 0.96, 'L2', 0, 'Ln', 0, 'N', 80, 'dt',...
        2.5e-4, 'om', 100*pi, 'b2', 13.917, 'b1', 1.761e-08);
%     CTParam = struct('s', 19.1e-4, 'l', 90e-2, 'w2', 239, 'w1', 2, 'I_rated',...
%         600, 'R2', 0.48, 'Rn', 0.96, 'L2', 0, 'Ln', 0, 'N', 80, 'dt',...
%         2.5e-4, 'om', 100*pi, 'b1', 1248, 'b2', -8444, 'b3', 1.608e4,...
%         'b4', -1.347e4, 'b5', 5623, 'b6', -1154, 'b7', 93.78);
end

%==========================================================================
%Функция расчет магнитной индукции без учета начальной. На основе результата 
%этой функции рассчитывается дисперсия и детектируется насыщение.
%==========================================================================
function Flux = flux (i_meas, CTParam)
            
      Flux = zeros (length(i_meas),1);
       
      for h1 = 2:length(i_meas)
          Flux(h1) = Flux(h1-1) + ((CTParam.R2 + CTParam.Rn) * (i_meas(h1)...
              + i_meas(h1-1)) * CTParam.dt / 2 / (CTParam.s * CTParam.w2)...
              + (i_meas(h1) - i_meas(1)) * (CTParam.L2 + CTParam.Ln) /...
              (CTParam.s * CTParam.w2));
      end
%       plot(1:length(Flux), Flux,1:length(Flux), i_meas/(max(i_meas)));
end

%==========================================================================
%Функция "for k" используется для взятия производной от зашумленного тока
%на основе 15 точек. Из-за этой функции на выходе теряются 7 измерений.
%==========================================================================
function i3 = derivative_of_meas(i2, CTParam)
    i3= 0; j = 15;
    for k = j:length(i2)
        t = (k-j:k-1)' * CTParam.dt;% Эта строка дает в временной ряд.
        H = [t ones(j,1)];
        M = i2(k-j+1:k,1);
        z = H \ M;
        i3(k-j+8,1) = z(1,1);
    end
end

%==========================================================================
%Функция сглаживания производной от тока. Принцип работы функции основан на
%фильтр Совецки-Голея. Сигнал сглаживается по 5 точкам. В результате этого
%на выходе функции 2 отсчета теряются.
%==========================================================================
function i4 = smuth_of_derivativeted_meas(i3, CTParam)
    j1 = 5; i4 = 0;

    for k1 = j1:length(i3(:,1))
        t = (k1-j1:k1-1)' * CTParam.dt;% Эта строка дает в временной ряд.
        H = [t ones(j1,1)];
        M = i3(k1-j1+1:k1);
        z = H \ M;
        i4(k1-j1+3,1) = z(1,1) * t(3) + z(2,1);
    end
%     plot(1:length(i3),i3,1:length(i4),i4);
end

%==========================================================================
%Функция проверка наличия КЗ в сети путем прогнозирования амплитуды
%измеренного тока.
%==========================================================================
function [Amplitude1, Amplitude2] = Apm(p, Amplitude1, i_meas, CTParam)

        i0 = i_meas(p);%измеренный ток 
        
        v0 = (i_meas(p - 1) - i_meas(p + 1)) / 2 / CTParam.dt;%Производная от тока
        
        Amplitude = sqrt(i0^2 + (v0 / CTParam.om)^2);%Амплитуда тока
        
        Amplitude2 = Amplitude1;
        
        Amplitude1 = Amplitude;
end

%==========================================================================
%
%==========================================================================
function [DENSITY_VAR, p] = input(i4, Flux, CTParam, p)
% Th_i2 = 0.62 -  это максимальная разница между уравнении линии и измерениями
% тока в условиях 3%-го белого шумам в нормальном режиме работы ТТ. Она
% получено при взятии производных от тока на основе 15 измерений и
% глаживании этой производной на основе 5 отсчетов.
% Th_B2 = 7.5e-5 - это минимальное значение дисперсии индукции при 1.2 кратном
% режиме работы ТТ. Дисперсия считалась на основе 8 точек.
    p = p;
    Sum_of_current_difference = 0;
    Th_i2 = 0.62 * 0.1 + 0.62;
    Th_B2 = 9.5e-5 * 1e5;
    j = 19; 
    SAT = 0;%дисперсия магнитной индукции
    DENSITY_VAR = 0;
    for k = j:length(i4(:,1))
        t = (k-j+8:k-1)' * CTParam.dt;% Эта строка дает в временной ряд.
        H = [t ones(j-8,1)];
        M = i4(k-j+9:k)/max(abs(i4(k-j+9:k)));
        x = H\M;
        Line = x(1,1) * t + x(2,1);
        SS = M-Line;
        Sum_of_current_difference(k-j+1,1) = sum(abs(SS),1);

        L = (k-j+12:k);
        SAT(k-j+1,1) = 1e5 * var(Flux(k-j+12:k)/max(abs(Flux(k-j+12:k))));

        if SAT(k-j+1) < Th_B2 && Sum_of_current_difference(k-j+1) > Th_i2
%            DENSITY_VAR = 1;
%            p = (k-j+6);
%            break
           for i = k:length(i4)
               DNS = var(Flux(i-15:i));
               if DNS < 0.0028
                DENSITY_VAR = 1;
                p = i - 16;
%                 SAT2(i - 16) = 1.2;
                break
               end
           end
           if DENSITY_VAR == 1
               break
           end
        end
    end
end

%==========================================================================
%Функция прогнозирования начала учаска насыщения. На основе результата 
%этой функции производится посик начальной индукции.
%==========================================================================
function Prognoz = prognoz (p, i_filter, CTParam)

      IPT = 11; %этот параметр определяет длину интервала правильной трансформации
      t = (p-IPT:p)'.* CTParam.dt;% с помощью этой строки индексация преобразуется в временной ряд
            
      A = [sin(100*pi * t) cos(100*pi * t)];
                        
      b = i_filter(p-IPT:p);
      
      z = A\b;
      
      M = (p+1:p+3)'; %первые три точки после момента насыщения
      Prognoz = z(1,1) * sin(CTParam.om * M.* CTParam.dt) + z(2,1) * cos(CTParam.om * M.* CTParam.dt);
%       plot(M,Prognoz, '-o', 1:length(i_filter), i_filter, n, i_ideal);
end

%==========================================================================
%В этой части алгоритма решается задача поиска начальной индукции с помощью
%минимизации целевой функции.
%==========================================================================
function [options, h5, i_reconstr] = initial (options, p,...
                           i_meas,Prognoz, CTParam, i_reconstr)
        
        for h4 = 1:40
        
            %Задание начальной индукции
            options.Initial = 1.5 + (h4-1)*0.01; 
            
            %Определение знака начальной индукции
            if i_meas(p) < 0
               options.Initial = -1*options.Initial;
            end
            
            %Проверка точности намагничивающего Тока im0
            for h5 = p+1:p+3
                
                B (h5) = options.Initial + ((CTParam.R2 + CTParam.Rn) * ...
                    (i_meas(h5) + i_meas(h5-1)) * CTParam.dt / 2 /...
                    (CTParam.s * CTParam.w2) + (i_meas(h5) - i_meas(h5-1))*...
                    (CTParam.L2 + CTParam.Ln) / (CTParam.s * CTParam.w2));
                
                options.Initial = B (h5);
            end
            B1 = B (p+1:p+3)';
            %намагничивающий ток
            im0 = (CTParam.l * CTParam.b1 * sinh(CTParam.b2 * B1)) / CTParam.w2;
            
            %восстановленный по кривой намагничивания ток
            i_curve = i_meas(p+1:p+3) + im0;

%             plot(n, i_meas, 'r-', n, i_ideal, 'k-', n(p+1:p+3), Prognoz, 'o-', ...
%                 n(p+1:p+3), i_curve, '-x','linewidth',1.2); grid minor;
            
            %погрешность восстановленного с помощью кривой намаг-я тока
            resudal = abs(Prognoz - i_curve) ./ abs(Prognoz) .* 100;
            
            error = norm(resudal);
            V = sum(abs(i_curve)) > sum(abs(Prognoz));
            if error < 10 && V >=1
                i_reconstr (p+1:p+3,1) = i_curve;
                break
            end
        end%h4
end

%==========================================================================
%Функция восстановления тока на каждом полупериоде.
%==========================================================================
function [p, i_reconstr, options] = compensate (i_meas, i_reconstr, h5, p,...
                                    CTParam, options)
                   
    Compensated = (i_meas);
    for h6 = h5+1:length(i_meas)
            Flux = options.Initial + ((CTParam.R2 + CTParam.Rn) * ...
                (i_meas(h6) + i_meas(h6-1)) * CTParam.dt/2/...
                 (CTParam.s * CTParam.w2) + (i_meas(h6) - i_meas(h6-1))*...
                 (CTParam.L2 + CTParam.Ln) / (CTParam.s * CTParam.w2));
             
            options.Initial = Flux;
            
            %Намагничивающий ток
            im0 = (CTParam.l * CTParam.b1 * sinh(CTParam.b2 * Flux)) / CTParam.w2; 
            
            Compensated(h6) = i_meas(h6) + im0; %Восстановление тока
            i_reconstr (h6,1) = Compensated(h6);%Замена неправильных измерений
%             plot(t, Compensated, t, i_ideal);
            if h6 > p
                p = h6; %Обновление счетчика
            end
            % Детекция Перехода Через Ноль По Восст-ному Току
            aa = sign(Compensated(h6-1)) + sign(Compensated(h6)); 
            if aa == 0
                i_reconstr(h6+1:end) = i_meas(h6+1:end);
%                 figure
%                 plot(1:length(i_reconstr),i_reconstr,1:length(i_reconstr),i_meas,1:length(i_reconstr),Compensated,'--'); grid minor;
%                 i_reconstr = [i_reconstr(1:h6); i_meas(h6+1:end)];
                
                options.SAT1 = 0;
                options.SAT2 = 0;
                options.Initial = 0;
               break
            elseif p >= length(i_meas)
                break
           end
    end
   
end

%==========================================================================
%Функция сниятия графиков и замена искаженных измеренний восстановленными
%==========================================================================
function Plot(n, i_reconstr, i_ideal, i_meas)
                   
    plot(n, i_reconstr, '--', n, i_ideal, '-', n, i_meas);
end